{
    "casting_id": "corvette-c6r",
    "name": "Corvette C6R",
    "description": {
        "en-us": "Corvette C6R Debut series 2006 First Editions Produced 2006 - Present Designer Jun Imai Number J3266\\n\\nThe Chevrolet Corvette C6.R is a grand touring racing car built by Pratt & Miller for Corvette Racing for use in endurance racing in the GT1, GT2 and LM GTE classes. The car replaced the Chevrolet Corvette C5-R and acts as the second generation Corvette Racing race car. The car is powered by a 7.0L Katech LS7.R V8, capable of producing 590 horsepower. The car mainly competed in the American Le Mans Series, FIA GT Championship and the Le Mans Series; a highly successful race car, the Corvette C6.R GT1 was highly dominant in the American Le Mans Series, earning a total of four consecutive drivers', constructors' and teams' championships. The Corvette C6.R was also successful abroad, with the car winning at its first showing at the 2005 24 Hours of Le Mans and later taking two more in 2008 and 2009. Following abandonment of GT1 regulations in the American Le Mans Series the Corvette C6.R GT1s were retired and replaced with GT2 versions of the Corvette C6.R, featuring detuned engines; the GT1s would compete in Europe until 2010 when they too were retired and replace with versions homologated to LM GTE regulations. The Corvette C6.Rs were retired from competition after 2013, being replaced by the Chevrolet Corvette C7.R . Eight chassis were produced for GT1 competition.",
        "pt-br": ""
    },
    "releases": [
        "data/releases/2006/j3266-corvette-c6r.json",
        "data/releases/2006/j3266-corvette-c6r-v2.json",
        "data/releases/2007/k7615-corvette-c6r.json",
        "data/releases/2007/k7615s-corvette-c6r.json",
        "data/releases/2007/k7615s-corvette-c6r-v2.json",
        "data/releases/2007/m3062-corvette-c6r.json",
        "data/releases/2008/m6961-corvette-c6r.json",
        "data/releases/2008/n1275-corvette-c6r.json",
        "data/releases/2009/p2391-corvette-c6r.json",
        "data/releases/2009/p2391-corvette-c6r-v2.json",
        "data/releases/2010/r8502-corvette-c6r.json",
        "data/releases/2010/t4433-corvette-c6r.json",
        "data/releases/2011/t8364-corvette-c6r.json",
        "data/releases/2012/w4245-corvette-c6r.json",
        "data/releases/2013/x8299-corvette-c6r.json",
        "data/releases/2015/cfn88-corvette-c6r.json",
        "data/releases/2018/fkt57-corvette-c6r.json",
        "data/releases/2019/fyl15-corvette-c6r.json",
        "data/releases/2021/gtn35-corvette-c6r.json",
        "data/releases/2022/hcv35-corvette-c6r.json"
    ],
    "specs": {},
    "designer": "Unknown",
    "debut_year": 2006,
    "manufacturer": "Mattel"
}