{
    "casting_id": "mclaren-p1",
    "name": "McLaren P1",
    "releases": [
        "data/releases/2015/cfh20-2015.json",
        "data/releases/2015/cfl29-2015.json",
        "data/releases/2016/dhp95-2016.json",
        "data/releases/2016/dhx19-2016.json",
        "data/releases/2017/dvb05-2017.json",
        "data/releases/2017/dwf33-2017.json",
        "data/releases/2017/dwh90-2017.json",
        "data/releases/2018/fjy00-2018.json",
        "data/releases/2018/gdk91-2018.json",
        "data/releases/2018/fjy08-2018.json",
        "data/releases/2019/gbb76-2019.json",
        "data/releases/2020/ghc36-2020.json",
        "data/releases/2020/ghf48-2020.json",
        "data/releases/2020/ghg73-2020.json",
        "data/releases/2021/x6999-2021-cadbury-purple.json",
        "data/releases/2022/hdg70-2022.json",
        "data/releases/2022/x6999-2022-burgundy.json",
        "data/releases/2023/hlr57-2023.json",
        "data/releases/2023/x6999-2023-fire-black.json",
        "data/releases/2024/htb85-2024.json",
        "data/releases/2024/htf65-2024.json",
        "data/releases/2024/htd92-2024.json",
        "data/releases/2025/x6999-2025-colorado-gold.json",
        "data/releases/2025/jcb78-2025.json",
        "data/releases/2026/x6999-2026-lio-blue.json"
    ],
    "specs": {
        "horsepower": 903
    },
    "designer": "Ryu Asada",
    "debut_year": 2015,
    "manufacturer": "McLaren",
    "description": {
        "en-us": "Description\nThe McLaren P1 is a limited-production high-performance hybrid sports car produced by McLaren Automotive. Designed by Frank Stephenson, Paul Howse and Rob Melville, the P1 was unveiled at the 2012 Paris Auto Show and acted as McLaren's halo car, it being considered by the press as the successor to the F1; each unit cost $1.15 million. The car is powered by a 3.8L McLaren M838TQ twin-turbocharged V8 along with a McLaren E-Motor electric motor mated to a 7-speed dual clutch; the car produces a combined power output of 903 horsepower. The car features a number of Formula One-derived features such as an instant power assist system and a drag reduction system incorporated into the car's rear wing, which is usually extended. Production began in October 2013 and ended in December 2015, with 375 units produced to \"maintain exclusivity\".",
        "pt-br": "Descrição\nO McLaren P1 é um carro esportivo híbrido de alto desempenho e produção limitada produzido pela McLaren Automotive. Projetado por Frank Stephenson, Paul Howse e Rob Melville, o P1 foi apresentado no Salão do Automóvel de Paris de 2012 e funcionou como o carro halo da McLaren, sendo considerado pela imprensa como o sucessor do F1; cada unidade custou US$ 1,15 milhão. O carro é movido por um V8 biturbo 3.8L McLaren M838TQ junto com um motor elétrico McLaren E-Motor acoplado a uma embreagem dupla de 7 velocidades; o carro produz uma potência combinada de 903 cavalos. O carro apresenta uma série de recursos derivados da Fórmula 1, como um sistema de assistência instantânea de potência e um sistema de redução de arrasto incorporado na asa traseira do carro, que geralmente é estendida. A produção começou em outubro de 2013 e terminou em dezembro de 2015, com 375 unidades produzidas para “manter a exclusividade”."
    }
}
